# VectorAtPoint Constructor (IList(XYZ))

---
C#Visual BasicVisual C++
Revit 2024 API
---
VectorAtPoint Constructor (IList<(Of <(<'XYZ>)>)>)
VectorAtPoint Class See Also
---
Creates object from an array of vectors
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public VectorAtPoint(
	IList<XYZ> vectors
)
```

Visual Basic
---
```text
Public Sub New ( _
	vectors As IList(Of XYZ) _
)
```

Visual C++
---
```text
public:
VectorAtPoint(
	IList<XYZ^>^ vectors
)
```

# ### Parameters
vectors
    Type: System.Collections.Generic..::..IList<(Of <(<'XYZ>)>)> Array of vectors, each corresponding to "measurement"
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when supplied vectors contain invalid (infinite or non-number) coordinates |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
VectorAtPoint Class
VectorAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace